## Production: website
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 2 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                       NAME                        |
|----------|---------------------------------------------------|
| recreate | `aws_amplify_domain_association.design_system_en` |
|          | `aws_amplify_domain_association.design_system_fr` |
| update   | `aws_amplify_app.design_system_docs_en`           |
|          | `aws_amplify_app.design_system_docs_fr`           |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_amplify_app.design_system_docs_en will be updated in-place
  ~ resource "aws_amplify_app" "design_system_docs_en" {
        id                            = "djtlis5vpn8jd"
        name                          = "Design System (EN)"
        tags                          = {}
        # (14 unchanged attributes hidden)

      ~ custom_rule {
          ~ target = "https://systeme-design.cdssandbox.xyz/fr/<*>" -> "https://systeme-design.alpha.canada.ca/fr/<*>"
            # (2 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # aws_amplify_app.design_system_docs_fr will be updated in-place
  ~ resource "aws_amplify_app" "design_system_docs_fr" {
        id                            = "d35vdwuoev573o"
        name                          = "Design System (FR)"
        tags                          = {}
        # (14 unchanged attributes hidden)

      ~ custom_rule {
          ~ target = "https://design-system.cdssandbox.xyz/en/<*>" -> "https://design-system.alpha.canada.ca/en/<*>"
            # (2 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # aws_amplify_domain_association.design_system_en must be replaced
-/+ resource "aws_amplify_domain_association" "design_system_en" {
      ~ arn                                 = "arn:aws:amplify:ca-central-1:307395567143:apps/djtlis5vpn8jd/domains/design-system.cdssandbox.xyz" -> (known after apply)
      ~ certificate_verification_dns_record = "_9b4bdf09a08208b1f2a004916857236d.design-system.cdssandbox.xyz. CNAME _dd96f904e9d4b55b5f6cb90265673a1f.wbvrndqxbl.acm-validations.aws." -> (known after apply)
      ~ domain_name                         = "design-system.cdssandbox.xyz" -> "design-system.alpha.canada.ca" # forces replacement
      ~ id                                  = "djtlis5vpn8jd/design-system.cdssandbox.xyz" -> (known after apply)
        # (3 unchanged attributes hidden)

      - sub_domain {
          - branch_name = "main" -> null
          - dns_record  = " CNAME d3iuk7ja29m4d5.cloudfront.net" -> null
          - verified    = false -> null
        }
      + sub_domain {
          + branch_name = "main"
          + dns_record  = (known after apply)
          + verified    = (known after apply)
        }
    }

  # aws_amplify_domain_association.design_system_fr must be replaced
-/+ resource "aws_amplify_domain_association" "design_system_fr" {
      ~ arn                                 = "arn:aws:amplify:ca-central-1:307395567143:apps/d35vdwuoev573o/domains/systeme-design.cdssandbox.xyz" -> (known after apply)
      ~ certificate_verification_dns_record = "_5665e47fe554d06930447e601dfe3019.systeme-design.cdssandbox.xyz. CNAME _47d9a097be46286e34d1b872c660f034.wbvrndqxbl.acm-validations.aws." -> (known after apply)
      ~ domain_name                         = "systeme-design.cdssandbox.xyz" -> "systeme-design.alpha.canada.ca" # forces replacement
      ~ id                                  = "d35vdwuoev573o/systeme-design.cdssandbox.xyz" -> (known after apply)
        # (3 unchanged attributes hidden)

      - sub_domain {
          - branch_name = "main" -> null
          - dns_record  = " CNAME d11p4cky421xv7.cloudfront.net" -> null
          - verified    = false -> null
        }
      + sub_domain {
          + branch_name = "main"
          + dns_record  = (known after apply)
          + verified    = (known after apply)
        }
    }

Plan: 2 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_amplify_app.design_system_docs_en"]
WARN - plan.json - main - Missing Common Tags: ["aws_amplify_app.design_system_docs_fr"]
WARN - plan.json - main - Missing Common Tags: ["aws_amplify_branch.main_en"]
WARN - plan.json - main - Missing Common Tags: ["aws_amplify_branch.main_fr"]

23 tests, 19 passed, 4 warnings, 0 failures, 0 exceptions

```

</details>
